docs/ERD.md
```mermaid
erDiagram
    MEMBER ||--o{ POST : writes
    MEMBER ||--o{ COMMENT : writes
    POST ||--o{ COMMENT : has
    COMMENT ||--o{ COMMENT : replies

    MEMBER {
        bigint id PK
        varchar nickname
        varchar password
        varchar email UK
        varchar role
        varchar provider
        varchar provider_id
        varchar login_type
        datetime created_at
        varchar created_by
        datetime updated_at
        varchar updated_by
    }

    POST {
        bigint id PK
        varchar title
        varchar content
        int view_count
        bigint member_id FK
        datetime created_at
        varchar created_by
        datetime updated_at
        varchar updated_by
    }

    COMMENT {
        bigint id PK
        varchar content
        bigint member_id FK
        bigint post_id FK
        bigint parent_id FK
        datetime created_at
        varchar created_by
        datetime updated_at
        varchar updated_by
    }
```
